{"_id":"65791965b805aa59c51e1b2a","Title":"The Shawshank Redemption","Description":"'The Shawshank Redemption' is a poignant drama that unfolds within the confines of a prison. It follows the transformative journey of Andy Dufresne, a banker wrongly convicted of murder. Amidst the harsh realities of prison life, Andy befriends fellow inmates and works to maintain his hope and dignity. The film explores themes of friendship, resilience, and the enduring power of the human spirit.","Year":1994,"Genre":"Drama","Director":{"Name":"Francis Ford Coppola","Bio":"Francis Ford Coppola is an American film director, producer, and screenwriter. He is considered one of the major figures of the New Hollywood filmmaking movement of the 1960s and 1970s. Coppola is the recipient of five Academy Awards, six Golden Globe Awards, two Palmes d'Or and a British Academy Film Award.","Birth":"1939-04-07"},"Featured":true,"Actors":["657938f193a1c0043c4cff0a","6579394993a1c0043c4cff0d","6579398b93a1c0043c4cff10"],"ImageURL":"https://m.media-amazon.com/images/I/81Ac5TJg5tL._AC_UY436_FMwebp_QL65_.jpg","__v":0}
{"_id":"65791ad2b805aa59c51e1b2d","Title":"The Godfather","Description":"The Godfather' is a cinematic masterpiece that delves into the intricate world of the Corleone crime family. Directed by Francis Ford Coppola, the film unfolds a tale of power, loyalty, and betrayal in the organized crime underworld. With iconic performances and a gripping narrative, it stands as a timeless exploration of family dynamics and the consequences of choices made in pursuit of power.","Year":1972,"Genre":"Crime","Director":{"Name":"Francis Ford Coppola","Bio":"Francis Ford Coppola is an American film director, producer, and screenwriter. He is considered one of the major figures of the New Hollywood filmmaking movement of the 1960s and 1970s. Coppola is the recipient of five Academy Awards, six Golden Globe Awards, two Palmes d'Or and a British Academy Film Award.","Birth":"1939-04-07"},"Featured":false,"Actors":["6579372e93a1c0043c4cfefb","6579361293a1c0043c4cfef2","6579377c93a1c0043c4cfefe"],"ImageURL":"https://m.media-amazon.com/images/I/714ZOEiVNtL._AC_UY436_FMwebp_QL65_.jpg","__v":0}
{"_id":"65791c06b805aa59c51e1b30","Title":"The Dark Knight","Description":"'The Dark Knight' is a gripping superhero thriller directed by Christopher Nolan. Batman faces his greatest challenge as he confronts the anarchic Joker, who wreaks havoc on Gotham City. The film explores complex themes of morality and chaos, anchored by outstanding performances, particularly Heath Ledger`s iconic portrayal of the Joker.","Year":2008,"Genre":"Action","Director":{"Name":"Christopher Nolan","Bio":"Christopher Edward Nolan CBE is a British and American filmmaker. Known for his Hollywood blockbusters with complex storytelling, Nolan is considered a leading filmmaker of the 21st century. His films have grossed more than $6 billion worldwide.","Birth":"1970-07-30"},"Featured":false,"Actors":["657937c293a1c0043c4cff01","6579384093a1c0043c4cff04","657938ab93a1c0043c4cff07"],"ImageURL":"https://m.media-amazon.com/images/I/91ebheNmoUL._AC_UY436_FMwebp_QL65_.jpg","__v":0}
{"_id":"65791d0bb805aa59c51e1b33","Title":"The Godfather Part II","Description":"'The Godfather: Part II' is a cinematic masterpiece directed by Francis Ford Coppola. The film delves into the dual narratives of Vito Corleone`s rise to power and his son Michael`s struggles to maintain the family empire. It skillfully weaves a tale of power, betrayal, and family, earning critical acclaim and multiple Academy Awards.","Year":1974,"Genre":"Crime","Director":{"Name":"Francis Ford Coppola","Bio":"Francis Ford Coppola is an American film director, producer, and screenwriter. He is considered one of the major figures of the New Hollywood filmmaking movement of the 1960s and 1970s. Coppola is the recipient of five Academy Awards, six Golden Globe Awards, two Palmes d'Or and a British Academy Film Award.","Birth":"1939-04-07"},"Featured":true,"Actors":["6579361293a1c0043c4cfef2","6579366193a1c0043c4cfef5","657936cc93a1c0043c4cfef8"],"ImageURL":"https://m.media-amazon.com/images/I/71Tn5ZErDiL._AC_UY436_FMwebp_QL65_.jpg","__v":0}
{"_id":"65791e07b805aa59c51e1b36","Title":"12 Angry Men","Description":"'12 Angry Men' is a classic courtroom drama directed by Sidney Lumet. Set almost entirely in a jury room, the film revolves around 12 jurors deliberating the guilt of a young defendant accused of murder. Tensions rise as one juror challenges the unanimous decision, leading to a powerful exploration of prejudice, justice, and reasonable doubt.","Year":1957,"Genre":"Crime","Director":{"Name":"Sidney Lumet","Bio":"Sidney Arthur Lumet was an American film director. Lumet started his career in theatre before transitioning to film where he gained a reputation for making realistic and gritty New York dramas which focused on the working class, tackled social injustices and often questioned authority.","Birth":"1924-06-25","Death":"2011-04-09"},"Featured":false,"Actors":["657934c593a1c0043c4cfee9","6579351493a1c0043c4cfeec","657935ae93a1c0043c4cfeef"],"ImageURL":"https://m.media-amazon.com/images/I/71FthvsNDDL._AC_UY436_FMwebp_QL65_.jpg","__v":0}
{"_id":"65791f15b805aa59c51e1b3c","Title":"Schindler's List","Description":"'Schindler's List' is a 1993 film directed by Steven Spielberg. It is a powerful and poignant portrayal of the true story of Oskar Schindler, a German businessman who saved the lives of over a thousand Polish Jews during the Holocaust by employing them in his enamelware and ammunitions factories. The film is known for its stark black-and-white cinematography, moving performances, and its exploration of themes such as humanity, morality, and the impact of individual actions in the face of unspeakable atrocities. 'Schindler's List' received critical acclaim and won seven Academy Awards, including Best Picture and Best Director.","Year":1993,"Genre":"Drama","Director":{"Name":"Steven Spielberg","Bio":"Steven Allan Spielberg is an American film director, producer and screenwriter. A major figure of the New Hollywood era and pioneer of the modern blockbuster, he is the most commercially successful director in history.","Birth":"1946-12-18"},"Featured":true,"Actors":["65792f2224d3cd9bfcb20010","657931c493a1c0043c4cfee3","6579345d93a1c0043c4cfee6"],"ImageURL":"https://m.media-amazon.com/images/I/81pBGFSSSwL._AC_UY436_FMwebp_QL65_.jpg","__v":0}
{"_id":"657920bfb805aa59c51e1b3f","Title":"The Lord of the Rings: The Return of the King","Description":"'The Lord of the Rings: The Return of the King' is an epic fantasy film directed by Peter Jackson. It concludes the epic trilogy as Frodo and Sam continue their quest to destroy the One Ring, leading to an epic battle for the fate of Middle-earth. The film received critical acclaim, winning numerous Academy Awards, including Best Picture.","Year":2003,"Genre":"Adventure","Director":{"Name":"Peter Jackson","Bio":"Peter Robert Jackson ONZ KNZM is a New Zealand film director, screenwriter and producer. He is best known as the director, writer and producer of the Lord of the Rings trilogy and the Hobbit trilogy, both of which are adapted from the novels of the same name by J. R. R. Tolkien. ","Birth":"1961-10-31"},"Featured":true,"Actors":["65792bb90d89e57ad6506d28","65792cdf0d89e57ad6506d31","65792c0c0d89e57ad6506d2b"],"ImageURL":"https://m.media-amazon.com/images/I/91LAfx+AZhL._AC_UY436_FMwebp_QL65_.jpg","__v":0}
{"_id":"657921f3b805aa59c51e1b42","Title":"Pulp Fiction","Description":"'Pulp Fiction' is a groundbreaking crime film directed by Quentin Tarantino. With a nonlinear narrative, it weaves interconnected stories of hitmen, boxers, and mobsters in Los Angeles. Known for its sharp dialogue, eclectic soundtrack, and memorable characters, the film is a cultural phenomenon that redefined modern cinema.","Year":2003,"Genre":"Crime","Director":{"Name":"Quentin Tarantino","Bio":"Quentin Jerome Tarantino is an American film director, screenwriter, and actor. His films are characterized by stylized violence, extended dialogue including a pervasive use of profanity, and references to popular culture.","Birth":"1963-03-27"},"Featured":true,"Actors":["65792d2c0d89e57ad6506d34","65792d730d89e57ad6506d37","65792dbc0d89e57ad6506d3a"],"ImageURL":"https://m.media-amazon.com/images/I/81wrPiZFKIL._AC_UY436_FMwebp_QL65_.jpg","__v":0}
{"_id":"657922cfb805aa59c51e1b45","Title":"The Lord of the Rings: The Fellowship of the Ring","Description":"'The Lord of the Rings: The Fellowship of the Ring' is a fantasy epic directed by Peter Jackson. It follows the journey of Frodo Baggins and the Fellowship as they seek to destroy the One Ring to prevent the dark lord Sauron`s return. Filled with breathtaking visuals, compelling characters, and a richly detailed world, the film is the first installment in the iconic 'Lord of the Rings' trilogy.","Year":2001,"Genre":"Adventure","Director":{"Name":"Peter Jackson","Bio":"Peter Robert Jackson ONZ KNZM is a New Zealand film director, screenwriter and producer. He is best known as the director, writer and producer of the Lord of the Rings trilogy and the Hobbit trilogy, both of which are adapted from the novels of the same name by J. R. R. Tolkien. ","Birth":"1961-10-31"},"Featured":true,"Actors":["65792bb90d89e57ad6506d28","65792c0c0d89e57ad6506d2b","65792c740d89e57ad6506d2e"],"ImageURL":"https://m.media-amazon.com/images/I/61kTo1-zgcL._SY679_.jpg","__v":0}
{"_id":"65792389b805aa59c51e1b48","Title":"The Good, the Bad and the Ugly","Description":"'The Good, the Bad and the Ugly' is a classic spaghetti western directed by Sergio Leone. Set during the American Civil War, it follows three morally ambiguous gunslingers—Blondie (the Good), Angel Eyes (the Bad), and Tuco (the Ugly)—as they search for buried treasure. Known for its iconic score, intense shootouts, and epic landscapes, the film is a quintessential example of the genre.","Year":1966,"Genre":"Western","Director":{"Name":"Sergio Leone","Bio":"Sergio Leone was an Italian film director, producer, and screenwriter, credited as the pioneer of the spaghetti Western genre. He is widely regarded as one of the most influential directors in the history of cinema. Leone's film-making style includes juxtaposing extreme close-up shots with lengthy long shots.","Birth":"1929-01-03","Death":"1989-04-30"},"Featured":true,"Actors":["65792a800d89e57ad6506d1f","65792af20d89e57ad6506d22","65792b440d89e57ad6506d25"],"ImageURL":"https://m.media-amazon.com/images/I/91BDDsP0clL._AC_UY436_FMwebp_QL65_.jpg","__v":0}
{"_id":"657924efb805aa59c51e1b4b","Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer.","Year":1991,"Genre":"Crime","Director":{"Name":"Jonathan Demme","Bio":"Jonathan Demme was a director and producer, known for The Silence of the Lambs (1991), Philadelphia (1993) and Rachel Getting Married (2008). He was married to Joanne Howard and Evelyn Purcell.","Birth":"1944-02-22","Death":"2017-04-26"},"Featured":true,"Actors":["657a13905134e29584068104","657a14945134e29584068108","657a17815134e2958406810c"],"ImageURL":"https://m.media-amazon.com/images/I/71G5bef7vZL._AC_UY436_FMwebp_QL65_.jpg","__v":0}
